In [2]:
import pandas as pd
import numpy as np

# Manipulowanie danymi

In [ ]:
df = pd.DataFrame(np.random.uniform(0,1,(5,3)))
df.columns = ['A', 'B', 'C']
df.index=(pd.date_range(start='2020-03-01', end='2020-03-05'))
display(df)

                   A         B         C
2020-03-01  0.990339  0.216897  0.663078
2020-03-02  0.263322  0.020651  0.758379
2020-03-03  0.320017  0.383464  0.588317
2020-03-04  0.831048  0.628982  0.872651
2020-03-05  0.273542  0.798047  0.185636

In [2]:
df = pd.DataFrame(np.random.uniform(0,1,(20,3)))
df.columns = ['A', 'B', 'C']
df.index = pd.RangeIndex(1,21)
df.index.name = 'id'

display(df.iloc[0:3])
display(df.iloc[17::])
display(df.index.name)
display(list(df.columns))
display(df.to_string(index=False, header=False))
display(df.sample(5))
print(df['A'])
print(df[['A','B']])
print(df.iloc[4])
print(df.iloc[[0, 5, 6, 7], [1, 2]])

           A         B         C
id
1   0.249064  0.545347  0.242221
2   0.155173  0.679641  0.629211
3   0.329436  0.870615  0.786192

           A         B         C
id
18  0.908261  0.706026  0.413502
19  0.180848  0.536802  0.086038
20  0.484865  0.045155  0.226481

'id'

['A', 'B', 'C']

'0.249064 0.545347 0.242221\n0.155173 0.679641 0.629211\n0.329436 0.870615 0.786192\n0.242955 0.613102 0.987182\n0.111734 0.369920 0.315780\n0.898743 0.068645 0.035214\n0.763415 0.909592 0.199312\n0.819948 0.283260 0.985310\n0.878211 0.589097 0.603394\n0.452934 0.406784 0.495354\n0.114413 0.842871 0.776036\n0.224878 0.433505 0.325316\n0.907105 0.803197 0.794139\n0.853982 0.921458 0.942438\n0.887128 0.227068 0.422018\n0.473524 0.471215 0.870263\n0.949243 0.653163 0.766754\n0.908261 0.706026 0.413502\n0.180848 0.536802 0.086038\n0.484865 0.045155 0.226481'

           A         B         C
id
18  0.908261  0.706026  0.413502
10  0.452934  0.406784  0.495354
14  0.853982  0.921458  0.942438
13  0.907105  0.803197  0.794139
15  0.887128  0.227068  0.422018

id
1     0.249064
2     0.155173
3     0.329436
4     0.242955
5     0.111734
6     0.898743
7     0.763415
8     0.819948
9     0.878211
10    0.452934
11    0.114413
12    0.224878
13    0.907105
14    0.853982
15    0.887128
16    0.473524
17    0.949243
18    0.908261
19    0.180848
20    0.484865
Name: A, dtype: float64
           A         B
id
1   0.249064  0.545347
2   0.155173  0.679641
3   0.329436  0.870615
4   0.242955  0.613102
5   0.111734  0.369920
6   0.898743  0.068645
7   0.763415  0.909592
8   0.819948  0.283260
9   0.878211  0.589097
10  0.452934  0.406784
11  0.114413  0.842871
12  0.224878  0.433505
13  0.907105  0.803197
14  0.853982  0.921458
15  0.887128  0.227068
16  0.473524  0.471215
17  0.949243  0.653163
18  0.908261  0.706026
19  0.180848  0.536802
20  0.484865  0.045155
A    0.111734
B    0.369920
C    0.315780
Name: 5, dtype: float64
           B         C
id
1   0.545347  0.242221
6   0.068645  0.035214
7   0.909592  0.199312
8   0.283260  0.985310

# Funkcja 'describe'

In [16]:
df = pd.DataFrame(np.random.uniform(-1,1,(5,3)))
display(df.gt(0))
display(df[df.gt(0)])
display(df.loc[df[0].gt(0), 0])
display(df.mean())
display(df.mean(axis=1))

       0      1      2
0   True  False   True
1   True   True  False
2  False   True  False
3   True  False  False
4   True   True  False

          0         1        2
0  0.735770       NaN  0.57295
1  0.788225  0.939717      NaN
2       NaN  0.982077      NaN
3  0.928069       NaN      NaN
4  0.991112  0.965584      NaN

0    0.735770
1    0.788225
3    0.928069
4    0.991112
Name: 0, dtype: float64

0    0.614015
1    0.230381
2   -0.301225
dtype: float64

0    0.135789
1    0.330671
2    0.053172
3   -0.017453
4    0.403104
dtype: float64

# Funkcja 'concat'

In [17]:
df1 = pd.DataFrame(np.random.uniform(0,1,(5,3)))
df2 = pd.DataFrame(np.random.uniform(0,1,(5,3)))
display(pd.concat([df1, df2]))

          0         1         2
0  0.300147  0.437640  0.381391
1  0.549785  0.700355  0.615305
2  0.434720  0.085812  0.577521
3  0.115736  0.936426  0.292639
4  0.938789  0.433193  0.040006
0  0.101643  0.627571  0.607881
1  0.002001  0.232415  0.600828
2  0.569839  0.776266  0.653593
3  0.793836  0.734201  0.765900
4  0.398405  0.039756  0.102380

# Sortowanie

In [24]:
df = pd.DataFrame({"x": [1, 2, 3, 4, 5],
                  "y": ['a', 'b', 'a', 'b', 'b']},
                  index=np.arange(5))
df.index.name='id'
print(df)
print(df.sort_index())
print(df.sort_values(by='y', ascending=False))

    x  y
id
0   1  a
1   2  b
2   3  a
3   4  b
4   5  b
    x  y
id
0   1  a
1   2  b
2   3  a
3   4  b
4   5  b
    x  y
id
1   2  b
3   4  b
4   5  b
0   1  a
2   3  a

# Grupowanie danych (prześledź działania)

In [26]:
slownik = {'Day': ['Mon', 'Tue', 'Mon', 'Tue', 'Mon'], 'Fruit': ['Apple',
'Apple', 'Banana', 'Banana', 'Apple'], 'Pound': [10, 15, 50, 40, 5], 'Profit':[20, 30, 25, 20, 10]}
df3 = pd.DataFrame(slownik)
print(df3)
print(df3.groupby('Day').sum())
print(df3.groupby(['Day','Fruit']).sum())

   Day   Fruit  Pound  Profit
0  Mon   Apple     10      20
1  Tue   Apple     15      30
2  Mon  Banana     50      25
3  Tue  Banana     40      20
4  Mon   Apple      5      10
                Fruit  Pound  Profit
Day
Mon  AppleBananaApple     65      55
Tue       AppleBanana     55      50
            Pound  Profit
Day Fruit
Mon Apple      15      30
    Banana     50      25
Tue Apple      15      30
    Banana     40      20

# Wypełnianie danych

In [40]:
df=pd.DataFrame(np.random.randn(20, 3), index=np.arange(20), columns=['A','B','C'])
df.index.name='id'
print(df)

           A         B         C
id
0   0.698021 -0.885706  0.273551
1   1.615637 -0.064033  0.292035
2  -0.375468 -0.072198 -1.261293
3  -0.105001 -1.379181 -1.437214
4  -0.839081  0.271706 -1.368260
5   0.404616  0.884423  1.255653
6  -0.035171 -0.528808  1.813648
7  -0.498200 -0.387607 -0.497347
8  -0.200880 -1.116605  0.225847
9  -1.339686  3.526996  0.384164
10  1.356386 -0.884188  0.778762
11 -0.803298  0.990689 -0.075788
12 -0.885019  0.387035  1.651333
13  0.455295  1.258131 -0.874296
14 -0.232655 -1.544953 -0.784982
15 -0.340725 -0.385854 -0.482818
16 -0.365916 -0.321263 -0.212684
17 -1.058076 -1.575834 -0.223228
18  0.322423  0.637459  1.090900
19  0.649665  0.347963  1.348072

In [ ]:
df['B']=1
print(df)
# ustawia każdy element z kolumny 'B' na wartość 1

           A  B          C
id
0   0.569168  1   0.125204
1   0.189071  1  10.000000
2   0.686782  1   1.131891
3   2.044257  1   0.936258
4   0.332845  1   0.576985
5   1.529919  1   1.047011
6   1.340760  1   0.435995
7   1.244187  1   2.530526
8   0.488487  1   1.350970
9   1.304671  1   0.053899
10  1.109617  1   0.920657
11  1.000795  1   0.518779
12  0.606074  1   1.070148
13  0.319588  1   0.153271
14  1.000362  1   1.495735
15  0.199067  1   0.729036
16  1.343291  1   1.137680
17  0.111777  1   0.009544
18  0.199286  1   0.033036
19  0.439227  1   0.637613

In [ ]:
df.iloc[1,2]=10
print(df)
# ustawia element z wiersza 1 i kolumny 2 na wartość 10

           A         B          C
id
0   0.524337  0.722455   1.355453
1   0.226458  1.067835  10.000000
2   1.298791  0.221759   0.116218
3   0.002620 -0.661393   0.951585
4   1.202040 -0.042092  -1.933355
5   0.268617  1.074074   0.238729
6   0.509500 -0.037208   0.013675
7   0.773762 -0.908228   0.167694
8   0.067189 -1.092647  -1.428124
9   1.679222  0.412397   0.430642
10 -0.568127  0.185774  -1.798939
11  2.142298  1.332233  -0.133946
12 -0.186999 -0.686640   0.855313
13  0.246298 -1.014864   0.081283
14  0.032661 -1.420750   0.869447
15 -2.491272  1.756565  -0.083795
16  0.285834  2.201841  -0.064324
17 -0.389997  1.032341   0.620837
18 -0.711948 -1.828903  -1.232448
19 -0.153898 -1.382548   0.160083

In [ ]:
df[df<0]=-df
print(df)
# zamienia wszystkie ujemne elementy na dodatnie

           A         B         C
id
0   1.321465  1.251158  0.052494
1   1.726818  0.253601  0.572555
2   1.070503  1.160306  0.398765
3   1.877266  0.262126  0.415417
4   0.043531  0.417440  0.620660
5   1.798994  0.152201  0.646089
6   0.458291  0.386704  1.401041
7   1.344924  0.411838  2.265860
8   0.619673  0.402432  1.289667
9   0.271179  0.732317  1.567242
10  0.208699  0.668776  0.020728
11  0.069654  0.204618  0.666968
12  0.283574  1.441884  0.448919
13  0.144501  0.230444  0.288124
14  0.694535  0.910975  0.807720
15  0.664256  1.437569  0.147248
16  0.791611  1.275530  0.813633
17  0.043955  0.607023  0.837359
18  0.227075  1.202251  0.473013
19  0.684062  1.125052  1.460513

# Uzupełnianie danych

In [42]:
df.iloc[[0, 3], 1] = np.nan
print(df)
# ustawia elementy z wiersza 0 i 3 w kolumnie 1 na NaN

           A         B         C
id
0   0.698021       NaN  0.273551
1   1.615637 -0.064033  0.292035
2  -0.375468 -0.072198 -1.261293
3  -0.105001       NaN -1.437214
4  -0.839081  0.271706 -1.368260
5   0.404616  0.884423  1.255653
6  -0.035171 -0.528808  1.813648
7  -0.498200 -0.387607 -0.497347
8  -0.200880 -1.116605  0.225847
9  -1.339686  3.526996  0.384164
10  1.356386 -0.884188  0.778762
11 -0.803298  0.990689 -0.075788
12 -0.885019  0.387035  1.651333
13  0.455295  1.258131 -0.874296
14 -0.232655 -1.544953 -0.784982
15 -0.340725 -0.385854 -0.482818
16 -0.365916 -0.321263 -0.212684
17 -1.058076 -1.575834 -0.223228
18  0.322423  0.637459  1.090900
19  0.649665  0.347963  1.348072

In [43]:
df.fillna(0, inplace=True)
print(df)
# ustawia wszystkie NaN na 0

           A         B         C
id
0   0.698021  0.000000  0.273551
1   1.615637 -0.064033  0.292035
2  -0.375468 -0.072198 -1.261293
3  -0.105001  0.000000 -1.437214
4  -0.839081  0.271706 -1.368260
5   0.404616  0.884423  1.255653
6  -0.035171 -0.528808  1.813648
7  -0.498200 -0.387607 -0.497347
8  -0.200880 -1.116605  0.225847
9  -1.339686  3.526996  0.384164
10  1.356386 -0.884188  0.778762
11 -0.803298  0.990689 -0.075788
12 -0.885019  0.387035  1.651333
13  0.455295  1.258131 -0.874296
14 -0.232655 -1.544953 -0.784982
15 -0.340725 -0.385854 -0.482818
16 -0.365916 -0.321263 -0.212684
17 -1.058076 -1.575834 -0.223228
18  0.322423  0.637459  1.090900
19  0.649665  0.347963  1.348072

In [45]:
df.iloc[[0, 3], 1] = np.nan
df=df.replace(to_replace=np.nan,value=-9999)
print(df)
# ustawia wszystkie NaN na -9999

           A            B         C
id
0   0.698021 -9999.000000  0.273551
1   1.615637    -0.064033  0.292035
2  -0.375468    -0.072198 -1.261293
3  -0.105001 -9999.000000 -1.437214
4  -0.839081     0.271706 -1.368260
5   0.404616     0.884423  1.255653
6  -0.035171    -0.528808  1.813648
7  -0.498200    -0.387607 -0.497347
8  -0.200880    -1.116605  0.225847
9  -1.339686     3.526996  0.384164
10  1.356386    -0.884188  0.778762
11 -0.803298     0.990689 -0.075788
12 -0.885019     0.387035  1.651333
13  0.455295     1.258131 -0.874296
14 -0.232655    -1.544953 -0.784982
15 -0.340725    -0.385854 -0.482818
16 -0.365916    -0.321263 -0.212684
17 -1.058076    -1.575834 -0.223228
18  0.322423     0.637459  1.090900
19  0.649665     0.347963  1.348072

In [ ]:
df.iloc[[0, 3], 1] = np.nan
print(pd.isnull(df))
# sprawdza czy elementy z wiersza 0 i 3 w kolumnie 1 sa NaN

        A      B      C
id
0   False   True  False
1   False  False  False
2   False  False  False
3   False   True  False
4   False  False  False
5   False  False  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False
10  False  False  False
11  False  False  False
12  False  False  False
13  False  False  False
14  False  False  False
15  False  False  False
16  False  False  False
17  False  False  False
18  False  False  False
19  False  False  False

# Zadania

In [52]:
df = pd.DataFrame({'x': [1, 2, 3, 4, 5], 'y': ['a', 'b', 'a', 'b', 'b']})

### Zadanie 1

In [ ]:
group = df.groupby('y')
print(group['x'].mean())

y
a    2.000000
b    3.666667
Name: x, dtype: float64

### Zadanie 2

In [51]:
print(df['y'].value_counts(normalize=True))

y
b    0.6
a    0.4
Name: proportion, dtype: float64

### Zadanie 3

In [4]:
data_np = np.loadtxt('autos.csv', dtype=str, delimiter=",")
display(data_np)

array([['', 'normalized-losses', 'make', ..., 'highway-mpg', 'price',
        'symboling'],
       ['0', '', 'alfa-romero', ..., '27.0', '13495.0', '3'],
       ['1', '', 'alfa-romero', ..., '27.0', '16500.0', '3'],
       ...,
       ['202', '95.0', 'volvo', ..., '23.0', '21485.0', '-1'],
       ['203', '95.0', 'volvo', ..., '27.0', '22470.0', '-1'],
       ['204', '95.0', 'volvo', ..., '25.0', '22625.0', '-1']],
      shape=(206, 27), dtype='<U17')

In [5]:
data_pd = pd.read_csv('autos.csv')
display(data_pd)

,Unnamed: 0,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price,symboling
0,0,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,mpfi,3.47,2.68,9.0,111.0,5000.0,21.0,27.0,13495.0,3
1,1,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,mpfi,3.47,2.68,9.0,111.0,5000.0,21.0,27.0,16500.0,3
2,2,NaN,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,mpfi,2.68,3.47,9.0,154.0,5000.0,19.0,26.0,16500.0,1
3,3,164.0,audi,gas,std,four,sedan,fwd,front,99.8,...,mpfi,3.19,3.40,10.0,102.0,5500.0,24.0,30.0,13950.0,2
4,4,164.0,audi,gas,std,four,sedan,4wd,front,99.4,...,mpfi,3.19,3.40,8.0,115.0,5500.0,18.0,22.0,17450.0,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,200,95.0,volvo,gas,std,four,sedan,rwd,front,109.1,...,mpfi,3.78,3.15,9.5,114.0,5400.0,23.0,28.0,16845.0,-1
201,201,95.0,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,mpfi,3.78,3.15,8.7,160.0,5300.0,19.0,25.0,19045.0,-1
202,202,95.0,volvo,gas,std,four,sedan,rwd,front,109.1,...,mpfi,3.58,2.87,8.8,134.0,5500.0,18.0,23.0,21485.0,-1
203,203,95.0,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,idi,3.01,3.40,23.0,106.0,4800.0,26.0,27.0,22470.0,-1
204,204,95.0,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,mpfi,3.78,3.15,9.5,114.0,5400.0,19.0,25.0,22625.0,-1

> #### Różnice 
##### np.loadtxt:
* czyta pliki do listy
* wymaga specyfikowania delimetru (tutaj przecinek)

##### pd.read_csv:
* czyta pliki do DataFrame
* automatycznie szuka delimetru

### Zadanie 4

In [ ]:
group = data_pd.groupby('make')
print(group[['city-mpg', 'highway-mpg']].mean())

                city-mpg  highway-mpg
make
alfa-romero    20.333333    26.666667
audi           18.857143    24.142857
bmw            19.375000    25.375000
chevrolet      41.000000    46.333333
dodge          28.000000    34.111111
honda          30.384615    35.461538
isuzu          31.000000    36.000000
jaguar         14.333333    18.333333
mazda          25.705882    31.941176
mercedes-benz  18.500000    21.000000
mercury        19.000000    24.000000
mitsubishi     24.923077    31.153846
nissan         27.000000    32.944444
peugot         22.454545    26.636364
plymouth       28.142857    34.142857
porsche        17.400000    26.000000
renault        23.000000    31.000000
saa            20.333333    27.333333
subaru         26.333333    30.750000
toyota         27.500000    32.906250
volkswagen     28.583333    34.916667
volvo          21.181818    25.818182

### Zadanie 5

In [14]:
print(group['fuel-type'].value_counts())

make           fuel-type
alfa-romero    gas           3
audi           gas           7
bmw            gas           8
chevrolet      gas           3
dodge          gas           9
honda          gas          13
isuzu          gas           4
jaguar         gas           3
mazda          gas          15
               diesel        2
mercedes-benz  diesel        4
               gas           4
mercury        gas           1
mitsubishi     gas          13
nissan         gas          17
               diesel        1
peugot         gas           6
               diesel        5
plymouth       gas           7
porsche        gas           5
renault        gas           2
saa            gas           6
subaru         gas          12
toyota         gas          29
               diesel        3
volkswagen     gas           8
               diesel        4
volvo          gas          10
               diesel        1
Name: count, dtype: int64

### Zadanie 6

### Zadanie 7

### Zadanie 8

### Zadanie 9

### Zadanie 10

### Zadanie 11